app/controllers/movies_controller.rb

  def index
    # bring ratings values
    m = Movie.new
    @all_ratings = m.ratings_values

    # get checked values
    @checked = Hash.new(false)
    params[:ratings].each_key { |key| @checked[key] = true } if params[:ratings] != nil

    # get title and release dates filters
    case params[:selected]
    when 'M'
      @movies = Movie.find(:all, :order => :title)
      @title_header = 'hilite'
    when 'R'
      @movies = Movie.find(:all, :order => :release_date)
      @release_date_header = 'hilite'
    else
      @movies = Movie.all if params[:ratings] == nil
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'R') ORDER BY release_date